app/Http/Controllers/PostController.php

    public function index()
    {
        $posts = DB::table('posts')->get();
---
select * from `posts`

    public function store(Request $request)
    {
        DB::table('posts')->insert([
            'title' => $request->title,
            'body' => $request->body
        ]);
---
insert into `posts` (`title`, `body`) values ('test', 'testasd')

    public function show($id)
    {
        $post = DB::table('posts')->where('id', $id)->first();
---
select * from `posts` where `id` = '1' limit 1

    public function edit($id)
    {
        $post = DB::table('posts')->where('id', $id)->first();
---
select * from `posts` where `id` = '20' limit 1

    public function destroy($id)
    {
        DB::table('posts')->where('id', $id)->delete();
        return back()->with('post_deleted', 'Post has been delete successfully!');
---
delete from `posts` where `id` = '9'
select * from `posts`